src/WinRMSharp.Tests/Data/Sessions/ProtocolGetCommandStateBeforeRun.yml

- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000000</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Create</a:Action>
          <w:OptionSet />
        </env:Header>
        <env:Body>
          <rsp:Shell>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
          </rsp:Shell>
        </env:Body>
      </env:Envelope>
  Response:
    StatusCode: 200
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:26 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse</a:Action>
          <a:MessageID>uuid:A9544914-E5A9-4416-AED3-4F07A994335A</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000000</a:RelatesTo>
        </s:Header>
        <s:Body>
          <x:ResourceCreated>
            <a:Address>http://windows-host:5985/wsman</a:Address>
            <a:ReferenceParameters>
              <w:ResourceURI>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
              <w:SelectorSet>
                <w:Selector Name="ShellId">14A5BF64-8F72-45BA-8DC3-28AF35241444</w:Selector>
              </w:SelectorSet>
            </a:ReferenceParameters>
          </x:ResourceCreated>
          <rsp:Shell xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell">
            <rsp:ShellId>14A5BF64-8F72-45BA-8DC3-28AF35241444</rsp:ShellId>
            <rsp:ResourceUri>http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</rsp:ResourceUri>
            <rsp:Owner>winrm-vm-003\Default</rsp:Owner>
            <rsp:ClientIP>73.53.37.241</rsp:ClientIP>
            <rsp:IdleTimeOut>PT7200.000S</rsp:IdleTimeOut>
            <rsp:InputStreams>stdin</rsp:InputStreams>
            <rsp:OutputStreams>stdout stderr</rsp:OutputStreams>
            <rsp:ShellRunTime>P0DT0H0M0S</rsp:ShellRunTime>
            <rsp:ShellInactivity>P0DT0H0M0S</rsp:ShellInactivity>
          </rsp:Shell>
        </s:Body>
      </s:Envelope>
- Request:
    Method: POST
    Url: https://127.0.0.1:5986/wsman
    Headers: {}
    Body: >-
      <?xml version="1.0" encoding="utf-16"?>

      <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
        <env:Header>
          <a:To>http://windows-host:5985/wsman</a:To>
          <a:ReplyTo>
            <a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
          </a:ReplyTo>
          <w:MaxEnvelopeSize a:mustUnderstand="true">153600</w:MaxEnvelopeSize>
          <a:MessageID>uuid:00000000-0000-0000-0000-000000000001</a:MessageID>
          <w:Locale a:mustUnderstand="false" xml:lang="en-US" />
          <p:DataLocale a:mustUnderstand="false" xml:lang="en-US" />
          <w:OperationTimeout>PT5S</w:OperationTimeout>
          <w:ResourceURI a:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
          <a:Action mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Receive</a:Action>
          <w:SelectorSet>
            <w:Selector Name="ShellId">14A5BF64-8F72-45BA-8DC3-28AF35241444</w:Selector>
          </w:SelectorSet>
        </env:Header>
        <env:Body>
          <rsp:Receive>
            <rsp:DesiredStream CommandId="de969dd4-2798-4a3c-9d57-28c1da9b2aa3">stdout stderr</rsp:DesiredStream>
          </rsp:Receive>
        </env:Body>
      </env:Envelope>
  Response:
    StatusCode: 500
    Headers:
      Server: Microsoft-HTTPAPI/2.0
      Date: Fri, 16 Dec 2022 23:58:26 GMT
    Body: >-
      <s:Envelope xml:lang="en-US" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
        <s:Header>
          <a:Action>http://schemas.dmtf.org/wbem/wsman/1/wsman/fault</a:Action>
          <a:MessageID>uuid:672DBF8D-53A4-42F1-94A8-110E11BEDF04</a:MessageID>
          <a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To>
          <a:RelatesTo>uuid:00000000-0000-0000-0000-000000000001</a:RelatesTo>
        </s:Header>
        <s:Body>
          <s:Fault>
            <s:Code>
              <s:Value>s:Sender</s:Value>
              <s:Subcode>
                <s:Value>w:InvalidSelectors</s:Value>
              </s:Subcode>
            </s:Code>
            <s:Reason>
              <s:Text xml:lang="en-US">The WS-Management service cannot process the request because the request contained invalid selectors for the resource. </s:Text>
            </s:Reason>
            <s:Detail>
              <w:FaultDetail>http://schemas.dmtf.org/wbem/wsman/1/wsman/faultDetail/UnexpectedSelectors</w:FaultDetail>
              <f:WSManFault xmlns:f="http://schemas.microsoft.com/wbem/wsman/1/wsmanfault" Code="2150858843" Machine="windows-host">
                <f:Message>The Windows Remote Shell received a request to perform an operation on a command identifier that does not exist. Either the command has completed execution or the client specified an invalid command identifier. </f:Message>
              </f:WSManFault>
            </s:Detail>
          </s:Fault>
        </s:Body>
      </s:Envelope>
